# Get2DCompLocation

## Description
```pascal
PROCEDURE Get2DCompLocation(
				hObject          : HANDLE;
				component        : INTEGER;
				VAR onBoundsCube : BOOLEAN;
				VAR offset       : REAL);
```

```python

def vs.Get2DCompLocation(hObject, component):
    return (onBoundsCube, offset)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|component|INTEGER||
|onBoundsCube|BOOLEAN||
|offset|REAL||

## Version
Availability: from Vectorworks 2020
## Category
* Objects - Custom